app/Controllers/Autor.php

    public function index()
    {
        $autores = $this->autorModel->findAll();
---
SELECT *
FROM `autor`

    public function create()
    {
        $rules = [
            'nombre' => 'required|min_length[3]|max_length[255]'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = [
            'nombre' => $this->request->getVar('nombre')
        ];

        $autorId = $this->autorModel->insert($data);
        $autor = $this->autorModel->find($autorId);
---
SELECT *
FROM `autor`
WHERE `autor`.`id` = '5'