app/Controllers/Categoria.php

SELECT *
FROM `categoria`
---
    public function index()
    {
        $categorias = $this->categoriaModel->findAll();

INSERT INTO `categoria` (`nombre`, `created_at`, `updated_at`) VALUES ('Drama', '2025-06-05 16:20:20', '2025-06-05 16:20:20')
SELECT *
FROM `categoria`
WHERE `categoria`.`id` = 6
---
    public function create()
    {
        $rules = [
            'nombre' => 'required|min_length[3]|max_length[255]'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = [
            'nombre' => $this->request->getVar('nombre')
        ];

        $categoriaId = $this->categoriaModel->insert($data);
        $categoria = $this->categoriaModel->find($categoriaId);

SELECT *
FROM `categoria`
WHERE `categoria`.`id` = '6'
UPDATE `categoria` SET `nombre` = 'Dramaa', `updated_at` = '2025-06-05 16:21:06'
WHERE `categoria`.`id` IN ('6')
---
    public function update($id = null)
    {
        $categoria = $this->categoriaModel->find($id);

        if (!$categoria) {
            return $this->failNotFound('Categoría no encontrada');
        }

        $rules = [
            'nombre' => 'required|min_length[3]|max_length[255]'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = [
            'nombre' => $this->request->getVar('nombre')
        ];

        $this->categoriaModel->update($id, $data);
        $categoria = $this->categoriaModel->find($id);

SELECT *
FROM `categoria`
WHERE `categoria`.`id` = '9'
DELETE FROM `categoria`
WHERE `id` IN ('9')
---
    public function delete($id = null)
    {
        $categoria = $this->categoriaModel->find($id);

        if (!$categoria) {
            return $this->failNotFound('Categoría no encontrada');
        }

        // Verificar si la categoría tiene libros asociados
        $librosAsociados = $this->categoriaModel->libros($id);
        if (!empty($librosAsociados)) {
            return $this->fail('No se puede eliminar la categoría porque tiene libros asociados', 409);
        }

        $this->categoriaModel->delete($id);