app/Controllers/Libro.php

SELECT *
FROM `libro`
---
    public function index()
    {
        $libros = $this->libroModel->findAll();

INSERT INTO `libro` (`titulo`, `descripcion`, `anio_publicacion`, `created_at`, `updated_at`) VALUES ('Sangre bajo tu hammock', 'probando cambio de descripcion con resource controller', '1', '2025-06-06 15:59:55', '2025-06-06 15:59:55')
---
    public function create()
    {
        $rules = [
            'titulo' => 'required|min_length[3]|max_length[255]',
            'descripcion' => 'permit_empty|string',
            'anio_publicacion' => 'permit_empty|numeric|greater_than[0]'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = [
            'titulo' => $this->request->getVar('titulo'),
            'descripcion' => $this->request->getVar('descripcion'),
            'anio_publicacion' => $this->request->getVar('anio_publicacion')
        ];

        try {
            // Crear el libro
            $libroId = $this->libroModel->insert($data);

SELECT *
FROM `libro`
WHERE `libro`.`id` = 11
---
            $this->libroModel->addCategorias($libroId, [$defaultCategoriaId]);

            // Obtener el libro con sus relaciones
            $libro = $this->libroModel->find($libroId);

SELECT *
FROM `autor`
WHERE `autor`.`id` = 1
SELECT *
FROM `categoria`
WHERE `categoria`.`id` = 1
---
    public function createWithRelations()
    {
        $rules = [
            'titulo' => 'required|min_length[3]|max_length[255]',
            'descripcion' => 'permit_empty|string',
            'anio_publicacion' => 'permit_empty|numeric|greater_than[0]',
            'autor_id' => 'required|numeric|greater_than[0]', // autor_id siempre requerido
            'categoria_id' => 'permit_empty|numeric|greater_than[0]'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        // Verificar si el autor y la categoría existen
        $autorId = $this->request->getVar('autor_id');
        $categoriaId = $this->request->getVar('categoria_id');

        if (!$this->autorModel->find($autorId)) {
            return $this->failNotFound('Autor no encontrado');
        }

        if (!$this->categoriaModel->find($categoriaId)) {

INSERT INTO `libro` (`titulo`, `descripcion`, `anio_publicacion`, `created_at`, `updated_at`) VALUES ('El Quijote', 'Las aventuras del ingenioso hidalgo don Quijote de la Mancha', 1605, '2025-06-05 20:27:45', '2025-06-05 20:27:45')
---
            'anio_publicacion' => $this->request->getVar('anio_publicacion')
        ];

        $libroId = $this->libroModel->insert($data);

SELECT *
FROM `libro`
WHERE `libro`.`id` = 8
---
    public function show($id = null)
    {
        $libro = $this->libroModel->find($id);

SELECT *
FROM `libro`
WHERE `libro`.`id` = '4'
---
    public function update($id = null)
    {
        $libro = $this->libroModel->find($id);

SELECT *
FROM `libro`
WHERE `libro`.`id` = '2'
---
        }

        // Obtener el libro actualizado con sus relaciones
        $libro = $this->libroModel->find($id);

SELECT *
FROM `libro`
WHERE `libro`.`id` = '11'
DELETE FROM `libro`
WHERE `id` IN ('11')
---
    public function delete($id = null)
    {
        $libro = $this->libroModel->find($id);

        if (!$libro) {
            return $this->failNotFound('Libro no encontrado');
        }

        $this->libroModel->delete($id);

SELECT *
FROM `libro`
WHERE `libro`.`id` = '2'
---
    public function autores($libroId)
    {
        $libro = $this->libroModel->find($libroId);

SELECT *
FROM `libro`
WHERE `libro`.`id` = '2'
---
    public function categorias($libroId)
    {
        $libro = $this->libroModel->find($libroId);

SELECT *
FROM `libro`
WHERE `libro`.`id` = '2'
---
    public function addAutor($libroId)
    {
        $libro = $this->libroModel->find($libroId);