app/Models/AutorModel.php

SELECT *
FROM `autor`
WHERE `nombre` = 'No especificado'
 LIMIT 1
---
    public function getDefaultAutor()
    {
        $autor = $this->where('nombre', 'No especificado')->first();