app/Models/CategoriaModel.php

    public function getDefaultCategoria()
    {
        $categoria = $this->where('nombre', 'Sin clasificar')->first();
---
SELECT *
FROM `categoria`
WHERE `nombre` = 'Sin clasificar'
 LIMIT 1

    public function libros($categoriaId)
    {
        return $this->db->table('libro_categoria')
            ->select('libro.*')
            ->join('libro', 'libro.id = libro_categoria.libro_id')
            ->where('libro_categoria.categoria_id', $categoriaId)
            ->get()
            ->getResultArray();
---
SELECT `libro`.*
FROM `libro_categoria`
JOIN `libro` ON `libro`.`id` = `libro_categoria`.`libro_id`
WHERE `libro_categoria`.`categoria_id` = '9'