app/Models/LibroModel.php

    public function autores($libroId)
    {
        return $this->db->table('libro_autor')
            ->select('autor.*')
            ->join('autor', 'autor.id = libro_autor.autor_id')
            ->where('libro_autor.libro_id', $libroId)
            ->get()
            ->getResultArray();
---
SELECT `autor`.*
FROM `libro_autor`
JOIN `autor` ON `autor`.`id` = `libro_autor`.`autor_id`
WHERE `libro_autor`.`libro_id` = 11

    public function categorias($libroId)
    {
        return $this->db->table('libro_categoria')
            ->select('categoria.*')
            ->join('categoria', 'categoria.id = libro_categoria.categoria_id')
            ->where('libro_categoria.libro_id', $libroId)
            ->get()
            ->getResultArray();
---
SELECT `categoria`.*
FROM `libro_categoria`
JOIN `categoria` ON `categoria`.`id` = `libro_categoria`.`categoria_id`
WHERE `libro_categoria`.`libro_id` = 11

    public function addAutores($libroId, $autores)
    {
        $data = [];
        foreach ($autores as $autorId) {
            $data[] = [
                'libro_id' => $libroId,
                'autor_id' => $autorId,
                'created_at' => date('Y-m-d H:i:s')
            ];
        }
        return $this->db->table('libro_autor')->insertBatch($data);
---
INSERT INTO `libro_autor` (`autor_id`, `created_at`, `libro_id`)
VALUES ('6','2025-06-06 15:59:55',11)

    public function addCategorias($libroId, $categorias)
    {
        $data = [];
        foreach ($categorias as $categoriaId) {
            $data[] = [
                'libro_id' => $libroId,
                'categoria_id' => $categoriaId,
                'created_at' => date('Y-m-d H:i:s')
            ];
        }
        return $this->db->table('libro_categoria')->insertBatch($data);
---
INSERT INTO `libro_categoria` (`categoria_id`, `created_at`, `libro_id`)
VALUES ('8','2025-06-06 15:59:55',11)